; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	thermograph1 - mode
	image3 - mode
	infrared2 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 image0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared2)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph1)
	(supports instrument7 image3)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star13)
)
(:goal (and
	(pointing satellite3 Phenomenon16)
	(have_image Star6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Planet8 image0)
	(have_image Phenomenon9 image0)
	(have_image Star10 thermograph1)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 image3)
	(have_image Star13 infrared2)
	(have_image Planet14 image0)
	(have_image Planet15 thermograph1)
	(have_image Phenomenon16 image0)
))

)

; plan
1. (turn_to satellite3 phenomenon16 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 phenomenon16)
   goals met: 1 of 12
2. (turn_to satellite2 groundstation2 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 12
3. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 12
4. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 12
5. (turn_to satellite2 planet15 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet15)
   goals met: 1 of 12
6. (take_image satellite2 planet15 instrument4 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 2 of 12
7. (turn_to satellite2 phenomenon12 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 12
8. (take_image satellite2 phenomenon12 instrument4 image3)
   added: (have_image phenomenon12 image3)
   goals met: 3 of 12
9. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 12
10. (take_image satellite2 phenomenon11 instrument4 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 4 of 12
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 12
12. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 12
13. (turn_to satellite0 phenomenon16 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 12
14. (take_image satellite0 phenomenon16 instrument1 image0)
   added: (have_image phenomenon16 image0)
   goals met: 5 of 12
15. (turn_to satellite0 phenomenon9 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 12
16. (take_image satellite0 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   goals met: 6 of 12
17. (turn_to satellite0 planet14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet14)
   goals met: 6 of 12
18. (take_image satellite0 planet14 instrument1 image0)
   added: (have_image planet14 image0)
   goals met: 7 of 12
19. (turn_to satellite0 planet8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
20. (take_image satellite0 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 8 of 12
21. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 8 of 12
22. (take_image satellite0 star13 instrument1 infrared2)
   added: (have_image star13 infrared2)
   goals met: 9 of 12
23. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 9 of 12
24. (take_image satellite2 star10 instrument4 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 10 of 12
25. (turn_to satellite2 star6 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star6)
   goals met: 10 of 12
26. (take_image satellite2 star6 instrument4 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 11 of 12
27. (turn_to satellite2 star7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star7)
   goals met: 11 of 12
28. (take_image satellite2 star7 instrument4 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 12 of 12
